LQM2015/stm32/Core/Src/audio_recorder.c
/**
 * @file audio_recorder.c
 * @brief Audio recorder implementation for I2S TDM PCM data recording
 * @date 2025-01-28
 */

/* Includes ------------------------------------------------------------------*/
#include "../Inc/audio_recorder.h"
#include "sai.h"
#include "fatfs.h"
#include "shell_log.h"
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include "cmsis_os.h"
#include "stm32h7xx_hal.h" // For SCB_InvalidateDCache_by_Addr

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
static AudioRecorder_t recorder = {0};
/* DMA buffer: placed in .dma_buffer (linker -> D3 SRAM 0x38000000) with 32-byte alignment.
 * Region configured via MPU (Region7) as non-cacheable & shareable, so no runtime cache maintenance required.
 * Rationale: BDMA cannot access DTCM; non-cacheable removes need for Clean/Invalidate calls.
 */
#if defined ( __GNUC__ )
__attribute__((section(".dma_buffer"), aligned(32)))
#endif
static uint16_t audio_buffer[AUDIO_BUFFER_SIZE / 2]; // 16-bit samples interleaved 8-channel TDM
static volatile bool buffer_ready = false;
static volatile bool half_buffer_ready = false;

static osSemaphoreId_t audio_data_sem = NULL;
static osThreadId_t audio_process_thread_id = NULL;

// External variables from fatfs
extern FATFS USERFatFS;
extern char USERPath[4];

/* Private function prototypes -----------------------------------------------*/
static void generate_filename(char* filename, size_t size);
static int write_audio_data(uint16_t* data, uint32_t size);
static void debug_sai_status(void);
static void monitor_sai_timing(void);
static void reset_sai_timing_status(void);
static void validate_sai_configuration(void);
void audio_recorder_process(void);
static int check_sd_card_status(void);
static void audio_process_thread(void *argument);
static int verify_file_exists(const char* filepath);

/* Private functions ---------------------------------------------------------*/

/**
 * @brief Generate filename based on audio parameters
 * @param filename: Buffer to store filename
 * @param size: Buffer size
 */
static void generate_filename(char* filename, size_t size)
{
    // For now, use a simple counter-based naming
    static uint32_t file_counter = 0;
    file_counter++;
    
    snprintf(filename, size, "audio_%dch_%dbit_%dHz_%03lu.pcm", 
             AUDIO_CHANNELS, AUDIO_BIT_DEPTH, AUDIO_SAMPLE_RATE, file_counter);
}

/**
 * @brief Write audio data to SD card
 * @param data: Audio data buffer
 * @param size: Data size in bytes
 * @retval 0: Success, -1: Error
 */
static int write_audio_data(uint16_t* data, uint32_t size)
{
    UINT bytes_written;
    FRESULT res;
    
    if (!recorder.file_open) {
        SHELL_LOG_USER_ERROR("Cannot write data, file not open");
        return -1;
    }
    
    res = f_write(&recorder.file, data, size, &bytes_written);
    if (res != FR_OK || bytes_written != size) {
        SHELL_LOG_USER_ERROR("Write failed, FRESULT: %d, requested: %lu, written: %lu", 
               res, (unsigned long)size, (unsigned long)bytes_written);
        return -1;
    }
    
    recorder.bytes_written += bytes_written;
    
    // Sync file periodically to ensure data is written.
    // Increased the interval to reduce the frequency of potentially long, blocking f_sync calls,
    // which might interfere with time-sensitive peripherals like SAI.
    if (recorder.bytes_written > 0 && recorder.bytes_written % (AUDIO_BUFFER_SIZE * 100) == 0) {
        SHELL_LOG_USER_DEBUG("Syncing file, total written: %lu bytes", (unsigned long)recorder.bytes_written);
        f_sync(&recorder.file);
    }
    
    return 0;
}

/**
 * @brief Debug SAI and DMA status
 */
static void debug_sai_status(void)
{
    SHELL_LOG_USER_DEBUG("=== SAI Status Debug ===");
    SHELL_LOG_USER_DEBUG("SAI State: %d", HAL_SAI_GetState(&hsai_BlockA4));
    SHELL_LOG_USER_DEBUG("SAI Error Code: 0x%08lX", hsai_BlockA4.ErrorCode);
    
    // Decode SAI error codes
    if (hsai_BlockA4.ErrorCode != HAL_SAI_ERROR_NONE) {
        SHELL_LOG_USER_ERROR("=== SAI Error Analysis ===");
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_OVR) {
            SHELL_LOG_USER_ERROR("- Overrun Error detected");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_UDR) {
            SHELL_LOG_USER_ERROR("- Underrun Error detected");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) {
            SHELL_LOG_USER_ERROR("- Anticipated Frame Sync Detection Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_LFSDET) {
            SHELL_LOG_USER_ERROR("- Late Frame Sync Detection Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_CNREADY) {
            SHELL_LOG_USER_ERROR("- Codec Not Ready Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_WCKCFG) {
            SHELL_LOG_USER_ERROR("- Wrong Clock Configuration Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_TIMEOUT) {
            SHELL_LOG_USER_ERROR("- Timeout Error");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_DMA) {
            SHELL_LOG_USER_ERROR("- DMA Error");
        }
    }
    
    // Check DMA status if available
    if (hsai_BlockA4.hdmarx != NULL) {
        SHELL_LOG_USER_DEBUG("DMA State: %d", HAL_DMA_GetState(hsai_BlockA4.hdmarx));
        SHELL_LOG_USER_DEBUG("DMA Error Code: 0x%08lX", hsai_BlockA4.hdmarx->ErrorCode);
        
        // Decode DMA error codes
        if (hsai_BlockA4.hdmarx->ErrorCode != HAL_DMA_ERROR_NONE) {
            SHELL_LOG_USER_ERROR("=== DMA Error Analysis ===");
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_TE) {
                SHELL_LOG_USER_ERROR("- DMA Transfer Error");
            }
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_FE) {
                SHELL_LOG_USER_ERROR("- DMA FIFO Error");
            }
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_DME) {
                SHELL_LOG_USER_ERROR("- DMA Direct Mode Error");
            }
            if (hsai_BlockA4.hdmarx->ErrorCode & HAL_DMA_ERROR_TIMEOUT) {
                SHELL_LOG_USER_ERROR("- DMA Timeout Error");
            }
        }
    } else {
        SHELL_LOG_USER_WARNING("DMA handle is NULL");
    }
    
