LQM2015/stm32/Core/Src/audio_recorder.c
    // Print SAI detailed status registers for Late Frame Sync analysis
    uint32_t sai_sr = hsai_BlockA4.Instance->SR;
    uint32_t sai_cr1 = hsai_BlockA4.Instance->CR1;
    uint32_t sai_frcr = hsai_BlockA4.Instance->FRCR;
    uint32_t sai_slotr = hsai_BlockA4.Instance->SLOTR;
    
    SHELL_LOG_USER_INFO("=== SAI Register Analysis ===");
    SHELL_LOG_USER_INFO("SAI4_Block_A Status Register (SR): 0x%08lX", sai_sr);
    SHELL_LOG_USER_INFO("  - FIFO Level: %ld/8", (sai_sr & SAI_xSR_FLVL) >> SAI_xSR_FLVL_Pos);
    SHELL_LOG_USER_INFO("  - Status Flags: %s%s%s%s%s%s%s", 
                        (sai_sr & SAI_xSR_OVRUDR) ? "OVR " : "",
                        (sai_sr & SAI_xSR_MUTEDET) ? "MUTE " : "",
                        (sai_sr & SAI_xSR_WCKCFG) ? "WCKCFG " : "",
                        (sai_sr & SAI_xSR_FREQ) ? "FREQ " : "",
                        (sai_sr & SAI_xSR_CNRDY) ? "CNRDY " : "",
                        (sai_sr & SAI_xSR_AFSDET) ? "AFSDET " : "",
                        (sai_sr & SAI_xSR_LFSDET) ? "LFSDET " : "");
    
    SHELL_LOG_USER_INFO("SAI4_Block_A Control (CR1): 0x%08lX", sai_cr1);
    SHELL_LOG_USER_INFO("  - Mode: %s", (sai_cr1 & SAI_xCR1_MODE) ? "Master" : "Slave");
    SHELL_LOG_USER_INFO("  - Protocol: %s", (sai_cr1 & SAI_xCR1_PRTCFG) ? "Free/Spdif" : "I2S/MSB/LSB/PCM");
    SHELL_LOG_USER_INFO("  - FIFO Threshold: %ld", (hsai_BlockA4.Instance->CR2 & SAI_xCR2_FTH) >> SAI_xCR2_FTH_Pos);
    
    SHELL_LOG_USER_INFO("SAI4_Block_A Frame (FRCR): 0x%08lX", sai_frcr);
    SHELL_LOG_USER_INFO("SAI4_Block_A Slot (SLOTR): 0x%08lX", sai_slotr);
    
    // Check if SAI is currently enabled and receiving data
    SHELL_LOG_USER_INFO("SAI Enabled: %s", (sai_cr1 & SAI_xCR1_SAIEN) ? "YES" : "NO");
    SHELL_LOG_USER_INFO("DMA Enabled: %s", (sai_cr1 & SAI_xCR1_DMAEN) ? "YES" : "NO");
    
    SHELL_LOG_USER_DEBUG("========================");
}

/**
 * @brief Monitor SAI timing status for Late Frame Sync Detection
 */
static void monitor_sai_timing(void)
{
    static uint32_t last_check_time = 0;
    static uint32_t lfsdet_count = 0;
    
    uint32_t current_time = HAL_GetTick();
    
    // Check every 1000ms during recording
    if (recorder.state == AUDIO_REC_RECORDING && 
        (current_time - last_check_time >= 1000)) {
        
        uint32_t sai_sr = hsai_BlockA4.Instance->SR;
        
        // Check for Late Frame Sync Detection flag
        if (sai_sr & SAI_xSR_LFSDET) {
            lfsdet_count++;
            SHELL_LOG_USER_WARNING("LFSDET detected (count: %ld), clearing flag", lfsdet_count);
            
            // Clear the flag to prevent continuous interrupts
            __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_LFSDET);
            
            // If too many LFSDET errors, suggest configuration changes
            if (lfsdet_count >= 3) {
                SHELL_LOG_USER_ERROR("Multiple LFSDET errors detected!");
                SHELL_LOG_USER_ERROR("Possible solutions:");
                SHELL_LOG_USER_ERROR("1. Check external I2S/TDM clock stability");
                SHELL_LOG_USER_ERROR("2. Verify signal integrity (scope trace)");
                SHELL_LOG_USER_ERROR("3. Consider adjusting SAI FIFO threshold");
                SHELL_LOG_USER_ERROR("4. Check for EMI interference");
            }
        }
        
        // Monitor FIFO level for early warning
        uint32_t fifo_level = (sai_sr & SAI_xSR_FLVL) >> SAI_xSR_FLVL_Pos;
        if (fifo_level == 0) {
            SHELL_LOG_USER_WARNING("SAI FIFO empty - possible timing issue");
        } else if (fifo_level >= 7) {
            SHELL_LOG_USER_WARNING("SAI FIFO near full (%ld/8) - possible overrun risk", fifo_level);
        }
        
        last_check_time = current_time;
    }
}

/**
 * @brief Reset SAI timing status and clear error flags
 */
static void reset_sai_timing_status(void)
{
    // Clear any existing SAI error flags
    __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_LFSDET);
    __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_AFSDET);
    __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_CNRDY);
    __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_FREQ);
    __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_WCKCFG);
    __HAL_SAI_CLEAR_FLAG(&hsai_BlockA4, SAI_FLAG_OVRUDR);
    
    // Reset error code
    hsai_BlockA4.ErrorCode = HAL_SAI_ERROR_NONE;
    
    SHELL_LOG_USER_INFO("SAI timing status reset, all error flags cleared");
}

/**
 * @brief Validate SAI configuration to ensure it's properly set to slave mode
 */
static void validate_sai_configuration(void)
{
    uint32_t sai_cr1 = hsai_BlockA4.Instance->CR1;
    uint32_t sai_cr2 = hsai_BlockA4.Instance->CR2;
    uint32_t sai_frcr = hsai_BlockA4.Instance->FRCR;
    uint32_t sai_slotr = hsai_BlockA4.Instance->SLOTR;
    
    SHELL_LOG_USER_INFO("=== SAI Configuration Validation ===");
    
    // Check if SAI is in slave mode (bit 1:0 should be 00 for slave RX)
    uint32_t mode = sai_cr1 & SAI_xCR1_MODE;
    if (mode == SAI_xCR1_MODE_1) {
        SHELL_LOG_USER_ERROR("ERROR: SAI is in MASTER TX mode (0x%02lX), should be SLAVE RX", mode >> SAI_xCR1_MODE_Pos);
    } else if (mode == (SAI_xCR1_MODE_1 | SAI_xCR1_MODE_0)) {
        SHELL_LOG_USER_ERROR("ERROR: SAI is in MASTER RX mode (0x%02lX), should be SLAVE RX", mode >> SAI_xCR1_MODE_Pos);
    } else if (mode == SAI_xCR1_MODE_0) {
        SHELL_LOG_USER_ERROR("ERROR: SAI is in SLAVE TX mode (0x%02lX), should be SLAVE RX", mode >> SAI_xCR1_MODE_Pos);
    } else {
        SHELL_LOG_USER_INFO("OK: SAI is in SLAVE RX mode");
    }
    
    // Check FIFO threshold
    uint32_t fifo_th = (sai_cr2 & SAI_xCR2_FTH) >> SAI_xCR2_FTH_Pos;
    SHELL_LOG_USER_INFO("FIFO Threshold: %ld (0=empty, 1=1/4, 2=1/2, 3=3/4, 4=full)", fifo_th);
    
    // Check frame length (should be 64 for 4ch*16bit)
    uint32_t frame_len = ((sai_frcr & SAI_xFRCR_FRL) >> SAI_xFRCR_FRL_Pos) + 1;
    if (frame_len != 64) {
        SHELL_LOG_USER_WARNING("Frame length is %ld, expected 64 for 4ch*16bit", frame_len);
    } else {
        SHELL_LOG_USER_INFO("OK: Frame length is %ld", frame_len);
    }
    
    // Check active slots
    uint32_t slot_active = (sai_slotr & SAI_xSLOTR_SLOTEN) >> SAI_xSLOTR_SLOTEN_Pos;
    if (slot_active != 0x0F) {
        SHELL_LOG_USER_WARNING("Active slots: 0x%02lX, expected 0x0F for 4 channels", slot_active);
    } else {
        SHELL_LOG_USER_INFO("OK: All 4 slots active (0x%02lX)", slot_active);
    }
    
    SHELL_LOG_USER_INFO("=== Configuration Validation Complete ===");
}

/**
 * @brief Check SD card status and try to fix common issues
 * @retval 0: Success, -1: Error
 */
static int check_sd_card_status(void)
{
    FRESULT res;
    FATFS *fs;
    DWORD fre_clust;
    
    SHELL_LOG_USER_INFO("=== SD Card Status Check ===");
    
    // Try to get free space (this tests if SD card is accessible)
    res = f_getfree("0:", &fre_clust, &fs);
    if (res == FR_OK) {
        SHELL_LOG_USER_INFO("SD card is accessible");
        SHELL_LOG_USER_INFO("Free clusters: %lu", fre_clust);
        SHELL_LOG_USER_INFO("Cluster size: %lu bytes", fs->csize * 512);
        SHELL_LOG_USER_INFO("Free space: %lu MB", (fre_clust * fs->csize) / 2048);
        return 0;
    }
    
