LQM2015/stm32/Core/Src/audio_recorder.c
    SHELL_LOG_USER_WARNING("SD card not accessible, FRESULT: %d", res);
    
    // Try to fix by unmounting and remounting
    SHELL_LOG_USER_INFO("Attempting to fix SD card access...");
    
    // Unmount first
    f_mount(NULL, "0:", 0);
    HAL_Delay(200);
    
    // Try to mount again
    res = f_mount(&USERFatFS, "0:", 1);
    if (res != FR_OK) {
        SHELL_LOG_USER_ERROR("Failed to remount SD card, FRESULT: %d", res);
        return -1;
    }
    
    // Verify the mount worked
    HAL_Delay(100);
    res = f_getfree("0:", &fre_clust, &fs);
    if (res != FR_OK) {
        SHELL_LOG_USER_ERROR("SD card still not accessible after remount, FRESULT: %d", res);
        return -1;
    }
    
    SHELL_LOG_USER_INFO("SD card access restored successfully");
    SHELL_LOG_USER_INFO("Free clusters: %lu", fre_clust);
    return 0;
}

/**
 * @brief Verify if a file exists on SD card (only when file is not currently open)
 * @param filepath: Path to check
 * @retval 0: File exists, -1: File doesn't exist
 */
static int verify_file_exists(const char* filepath)
{
    FILINFO fno;
    FRESULT res = f_stat(filepath, &fno);
    if (res == FR_OK) {
        SHELL_LOG_USER_INFO("File %s exists, size: %lu bytes", filepath, (unsigned long)fno.fsize);
        return 0;
    } else {
        SHELL_LOG_USER_WARNING("File %s does not exist, FRESULT: %d", filepath, res);
        return -1;
    }
}

/* Exported functions --------------------------------------------------------*/

/**
 * @brief Initialize audio recorder
 * @retval 0: Success, -1: Error
 */
int audio_recorder_init(void)
{
    SHELL_LOG_USER_INFO("Initializing audio recorder...");
    
    // Initialize recorder structure
    recorder.channels = AUDIO_CHANNELS;
    recorder.bit_depth = AUDIO_BIT_DEPTH;
    recorder.sample_rate = AUDIO_SAMPLE_RATE;
    recorder.state = AUDIO_REC_IDLE;
    recorder.buffer_size = AUDIO_BUFFER_SIZE;
    recorder.bytes_written = 0;
    recorder.file_open = false;
    
    SHELL_LOG_USER_INFO("Config: %d channels, %d-bit, %d Hz, buffer size: %lu", 
           recorder.channels, recorder.bit_depth, recorder.sample_rate, (unsigned long)recorder.buffer_size);
    
    // Clear audio buffer
    memset(audio_buffer, 0, sizeof(audio_buffer));

    // Create semaphore for data processing
    audio_data_sem = osSemaphoreNew(1, 0, NULL);
    if (audio_data_sem == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio data semaphore");
        return -1;
    }

    // Create audio processing thread
    const osThreadAttr_t audio_process_thread_attributes = {
        .name = "AudioProcess",
        .stack_size = 512 * 4, // 2KB stack
        .priority = (osPriority_t) osPriorityHigh,
    };
    audio_process_thread_id = osThreadNew(audio_process_thread, NULL, &audio_process_thread_attributes);
    if (audio_process_thread_id == NULL) {
        SHELL_LOG_USER_ERROR("Failed to create audio processing thread");
        return -1;
    }
    
    SHELL_LOG_USER_INFO("Audio recorder initialization completed, state: %d", recorder.state);
    return 0;
}

/**
 * @brief Start audio recording
 * @retval 0: Success, -1: Error
 */
int audio_recorder_start(void)
{
    FRESULT res;
    
    SHELL_LOG_USER_INFO("Starting audio recording...");
    SHELL_LOG_USER_DEBUG("Current state: %d (IDLE=%d, RECORDING=%d, STOPPING=%d, ERROR=%d)", 
                         recorder.state, AUDIO_REC_IDLE, AUDIO_REC_RECORDING, AUDIO_REC_STOPPING, AUDIO_REC_ERROR);
    
    // 如果在错误状态，先重置到空闲状态
    if (recorder.state == AUDIO_REC_ERROR) {
        SHELL_LOG_USER_WARNING("Recorder in error state, resetting to idle");
        recorder.state = AUDIO_REC_IDLE;
        recorder.file_open = false;
    }
    
    // 如果在停止状态，等待完成或强制重置
    if (recorder.state == AUDIO_REC_STOPPING) {
        SHELL_LOG_USER_WARNING("Recorder in stopping state, forcing reset to idle");
        recorder.state = AUDIO_REC_IDLE;
        recorder.file_open = false;
    }
    
    if (recorder.state != AUDIO_REC_IDLE) {
        SHELL_LOG_USER_ERROR("Cannot start recording, current state: %d (expected IDLE=%d)", 
                             recorder.state, AUDIO_REC_IDLE);
        return -1; // Already recording
    }
    
    // Check and fix SD card status first
    if (check_sd_card_status() != 0) {
        SHELL_LOG_USER_ERROR("SD card is not ready for recording");
        recorder.state = AUDIO_REC_ERROR;
        return -1;
    }
    
    // Reset SAI timing status and clear any error flags
    reset_sai_timing_status();
    
    // Validate SAI configuration before starting
    validate_sai_configuration();
    
    // Check if SD card is mounted first
    SHELL_LOG_USER_DEBUG("Checking SD card mount status...");
    FATFS *fs;
    DWORD fre_clust;
    res = f_getfree("0:", &fre_clust, &fs);
    if (res != FR_OK) {
        SHELL_LOG_USER_ERROR("SD card not mounted or accessible, FRESULT: %d", res);
        
        // Print detailed error information for f_getfree
        switch(res) {
            case FR_NOT_READY:
                SHELL_LOG_USER_ERROR("Drive not ready - SD card may not be inserted or initialized");
                break;
            case FR_DISK_ERR:
                SHELL_LOG_USER_ERROR("Disk error - SD card hardware issue");
                break;
            case FR_NOT_ENABLED:
                SHELL_LOG_USER_ERROR("Volume not enabled");
                break;
            case FR_NO_FILESYSTEM:
                SHELL_LOG_USER_ERROR("No valid filesystem found on SD card");
                break;
            default:
                SHELL_LOG_USER_ERROR("Unknown error code: %d", res);
                break;
        }
        
        SHELL_LOG_USER_INFO("Attempting to unmount and remount SD card...");
        
        // First try to unmount
        f_mount(NULL, USERPath, 0);
        HAL_Delay(100);
        
        // Try to mount with force flag
        res = f_mount(&USERFatFS, USERPath, 1);
        if (res != FR_OK) {
            SHELL_LOG_USER_ERROR("Failed to mount SD card, FRESULT: %d", res);
            
            // Print detailed mount error information
            switch(res) {
                case FR_NOT_READY:
                    SHELL_LOG_USER_ERROR("Mount failed: Drive not ready");
                    break;
                case FR_DISK_ERR:
                    SHELL_LOG_USER_ERROR("Mount failed: Disk error");
                    break;
                case FR_NOT_ENABLED:
                    SHELL_LOG_USER_ERROR("Mount failed: Volume not enabled");
                    break;
                case FR_NO_FILESYSTEM:
                    SHELL_LOG_USER_ERROR("Mount failed: No filesystem");
                    break;
                case FR_INVALID_DRIVE:
                    SHELL_LOG_USER_ERROR("Mount failed: Invalid drive");
                    break;
                default:
                    SHELL_LOG_USER_ERROR("Mount failed: Unknown error %d", res);
                    break;
            }
            
            recorder.state = AUDIO_REC_ERROR;
            return -1;
        }
        SHELL_LOG_USER_INFO("SD card mounted successfully");
        
