LQM2015/stm32/Core/Src/audio_recorder.c
    if (overall_result == 0) {
        SHELL_LOG_USER_INFO("Audio recording stopped successfully");
    } else {
        SHELL_LOG_USER_WARNING("Audio recording stopped with errors");
    }
    
    return overall_result;
}

/**
 * @brief Get current recorder state
 * @retval Current state
 */
AudioRecorderState_t audio_recorder_get_state(void)
{
    return recorder.state;
}

/**
 * @brief Get total bytes written
 * @retval Bytes written
 */
uint32_t audio_recorder_get_bytes_written(void)
{
    return recorder.bytes_written;
}

/**
 * @brief Get current filename
 * @retval Filename string
 */
const char* audio_recorder_get_filename(void)
{
    return recorder.filename;
}

/**
 * @brief Debug current audio recorder status
 */
void audio_recorder_debug_status(void)
{
    SHELL_LOG_USER_INFO("=== Audio Recorder Status ===");
    SHELL_LOG_USER_INFO("State: %d", recorder.state);
    SHELL_LOG_USER_INFO("Channels: %d", recorder.channels);
    SHELL_LOG_USER_INFO("Bit depth: %d", recorder.bit_depth);
    SHELL_LOG_USER_INFO("Sample rate: %d", recorder.sample_rate);
    SHELL_LOG_USER_INFO("Buffer size: %lu", (unsigned long)recorder.buffer_size);
    SHELL_LOG_USER_INFO("Bytes written: %lu", (unsigned long)recorder.bytes_written);
    SHELL_LOG_USER_INFO("File open: %s", recorder.file_open ? "Yes" : "No");
    SHELL_LOG_USER_INFO("Filename: %s", recorder.filename);
    
    // Always check SD card status
    check_sd_card_status();
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        debug_sai_status();
        
        // 检查当前缓冲区内容
        int current_non_zero = 0;
        for (int i = 0; i < 10 && i < AUDIO_BUFFER_SIZE / 4; i++) {
            if (audio_buffer[i] != 0) current_non_zero++;
        }
        SHELL_LOG_USER_INFO("Current non-zero samples in first 10: %d", current_non_zero);
        SHELL_LOG_USER_INFO("First few samples: 0x%04X 0x%04X 0x%04X 0x%04X", 
                           audio_buffer[0], audio_buffer[1], audio_buffer[2], audio_buffer[3]);
    }
    
    SHELL_LOG_USER_INFO("=============================");
}

/**
 * @brief Check SD card status
 * @retval 0: Success, -1: Error
 */
int audio_recorder_check_sd_card(void)
{
    return check_sd_card_status();
}

/**
 * @brief Audio processing thread function
 * @param argument: Not used
 */
static void audio_process_thread(void *argument)
{
    (void)argument;
    for (;;) {
        // Wait for a signal from the DMA callbacks
        if (osSemaphoreAcquire(audio_data_sem, osWaitForever) == osOK) {
            // Call the processing function if recording
            if (recorder.state == AUDIO_REC_RECORDING) {
                audio_recorder_process();
            }
        }
    }
}

/**
 * @brief Process audio data buffers. This should be called from the main loop.
 */
void audio_recorder_process(void)
{
    if (recorder.state != AUDIO_REC_RECORDING) {
        return;
    }

    // Monitor SAI timing status for Late Frame Sync issues
    monitor_sai_timing();

    if (half_buffer_ready) {
        half_buffer_ready = false;
    // Non-cacheable region: no invalidate required
        if (write_audio_data(&audio_buffer[0], AUDIO_BUFFER_SIZE / 2) != 0) {
            SHELL_LOG_USER_ERROR("Failed to write first half of buffer, stopping recording.");
            audio_recorder_stop();
            recorder.state = AUDIO_REC_ERROR;
        }
    }

    if (buffer_ready) {
        buffer_ready = false;
    // Non-cacheable region: no invalidate required
        if (write_audio_data(&audio_buffer[AUDIO_BUFFER_SIZE / 4], AUDIO_BUFFER_SIZE / 2) != 0) {
            SHELL_LOG_USER_ERROR("Failed to write second half of buffer, stopping recording.");
            audio_recorder_stop();
            recorder.state = AUDIO_REC_ERROR;
        }
    }
}

/* Callback functions --------------------------------------------------------*/

/**
 * @brief SAI RX complete callback
 */
void audio_recorder_rx_complete_callback(void)
{
    /* Keep callbacks lightweight: no debug log unless verbose */
    SHELL_LOG_USER_DEBUG("SAI RX complete");
    if (recorder.state == AUDIO_REC_RECORDING) {
        buffer_ready = true;
        osSemaphoreRelease(audio_data_sem);
    }
}

/**
 * @brief SAI RX half complete callback
 */
void audio_recorder_rx_half_complete_callback(void)
{
    /* Half complete */
    SHELL_LOG_USER_DEBUG("SAI RX half");
    if (recorder.state == AUDIO_REC_RECORDING) {
        half_buffer_ready = true;
        osSemaphoreRelease(audio_data_sem);
    }
}

/**
 * @brief SAI error callback
 */
void audio_recorder_error_callback(void)
{
    SHELL_LOG_USER_ERROR("SAI error callback (state=%d)", recorder.state);
    
    if (recorder.state == AUDIO_REC_RECORDING) {
        SHELL_LOG_USER_ERROR("SAI error during recording, stopping...");
        
        // Print detailed status at the moment of error
        debug_sai_status();
        
        // Check and provide specific error guidance
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_LFSDET) {
            SHELL_LOG_USER_ERROR("Late Frame Sync detected");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_AFSDET) {
            SHELL_LOG_USER_ERROR("Anticipated Frame Sync detected - frame timing issue");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI frame configuration and external codec");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_OVR) {
            SHELL_LOG_USER_ERROR("SAI Overrun - data not read fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and buffer handling");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_UDR) {
            SHELL_LOG_USER_ERROR("SAI Underrun - data not supplied fast enough");
            SHELL_LOG_USER_ERROR("Suggestion: Check DMA configuration and data flow");
        }
        if (hsai_BlockA4.ErrorCode & HAL_SAI_ERROR_WCKCFG) {
            SHELL_LOG_USER_ERROR("Wrong Clock Configuration detected");
            SHELL_LOG_USER_ERROR("Suggestion: Verify SAI clock settings and PLL configuration");
        }
        
        recorder.state = AUDIO_REC_ERROR;
        
        // Stop DMA and close file
        HAL_SAI_DMAStop(&hsai_BlockA4);
        // if (recorder.file_open) {
        //     f_close(&recorder.file);
        //     recorder.file_open = false;
        // }
        
        SHELL_LOG_USER_ERROR("Recording stopped due to SAI error");
    }
}